{
	"version": "https://jsonfeed.org/version/1.1",
	"title": "Secret Choir",
	"language": "en",
	"home_page_url": "https://secretchoir.com/",
	"feed_url": "https://secretchoir.com/feed/feed.json",
	"description": "A music blog, built with Octobug",
	"author": {
		"name": "Casey K",
		"url": "https://casey.kolderup.org"
	},
	"items": [
		{
			"id": "https://secretchoir.com/post/1741130846552/",
			"url": "https://secretchoir.com/post/1741130846552/",
			"title": "Cheekface - _Middle Spoon_",
			"content_html": "<p><a href=\"https://cheekface.bandcamp.com/album/middle-spoon\">https://cheekface.bandcamp.com/album/middle-spoon</a></p>\n<p>Last year's album <em>It's Sorted</em> felt kind of like they had polished the whole Cheekface bit to a perfect point so it's not surprising that this one would be a ~transitional record~; it sounds like the members of the band have been through a lot in the last year (relatable!) and this album is being kind of press junketed as the result of that but I'm not sure that really pays off. I think it's cool that they collaborated with McKinley Dixon for \"Military Gum\" but I'm not sure the result is as good as a Cheekface track or a McKinley Dixon track. \"Growth Sux\" has a funny and possibly insightful point but to me it feels like they barely scratched the surface and I find it hard to say where their commonly-employed satirical voice ends on the topic, which sort of defeats the point of their whole schtick.</p>\n<p>I do think there's something cool that's happening with Cheekface's particular blend of music and writing and comedy and politics and I want to see it continue and get better and smarter. There are individual moments on here that are catchy enough that I'm sure they will pop into my head unbidden for years to come (\"Wind is Gone\"'s refrain of \"Dial 999-9999\" has been on loop, maddeningly, for the past 48 hours), but... I dunno. I'm not seeing the depth that I know they are capable of.</p>\n"
	,
			"tags": [
					"cheekface"
					,
					"album review"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1740989632973/",
			"url": "https://secretchoir.com/post/1740989632973/",
			"title": "2024 You Could Make a Case For: Your Old Droog - &quot;Movie&quot;",
			"content_html": "<p><a href=\"https://www.youtube.com/watch?v=RKOpb-fZdnI\">https://www.youtube.com/watch?v=RKOpb-fZdnI</a></p>\n<p>Your Old Droog is the kind of rapper who can release a song with Denzel Curry and Method Man verses and a <em>Celebrity Death Match</em>-inspired music video in 2024 and still be someone you might not know exists; a weird mix of access to the ability to realize a creative vision and also criminal near-anonymity in the mainstream. I was made aware of him via his 2017 collaboration with Heems \"Bangladesh\", a song I'll probably dedicate at least one full post to at some point, and I did listen to the album it was on (<em>Packs</em>) a decent amount, but I somehow checked out for... 6 albums in 7 years after that?</p>\n<p><em>Movie</em>, from last year, has <em>Pretty Toney</em>-era decadence vibes. \"I Think I Love Her\" is a slick parasocial love song complete with a music video that feels like the perfect companion to Charli XCX's \"Boys\" visual. \"Mantra\" addresses his upbringing as a Russian immigrant. \"The Interview\" is maybe the funniest skit I've heard on a hip-hop album since Prince Paul's peak? \"What Else\" recalls Clipse's \"Mr. Me Too\" with its confidence.</p>\n<p>There's also an incredible punch-in tactic at play on a handful of tracks on this album where Droog acts as his own... hype man, sort of? Because one of the things that he does is self-consciously shout \"what?\" or \"who?\" whenever he makes a reference that I guess he thinks is too obscure? It's so funny and weird and charming and is honestly the best argument for why you should listen to this album, so I'll stop there.</p>\n"
	,
			"tags": [
					"your old droog"
					,
					"2024"
					,
					"you could make a case for"
					,
					"who?"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1740985539329/",
			"url": "https://secretchoir.com/post/1740985539329/",
			"title": "Untitled Post",
			"content_html": "<p><img src=\"https://secretchoir.com/attachments/2025/3/3/02%2010%2058%2001%20PM%20(Plex).jpg\" alt=\"Ice Spice sitting on a basketball hoop in the \" Munch=\"\" (Feelin=\"\" You)\"=\"\" music=\"\" video\"=\"\"></p>\n<p>The whole Ice Spice thing has maybe not panned out so far the way it looked like she might when she co-starred with Nicki in the \"Barbie World\" interpolation in 2023 but nothing can take away the moment of watching this video when it came out and being like \"oh shit Worldstar is actually breaking a genuine new star in 2022?\"</p>\n"
	,
			"tags": [
					"ice spice"
					,
					"WorldStarHipHop"
					,
					"music videos"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1740940846055/",
			"url": "https://secretchoir.com/post/1740940846055/",
			"title": "Untitled Post",
			"content_html": "<p><a href=\"https://youtube.com/watch?v=v6HBZC9pZHQ\">https://youtube.com/watch?v=v6HBZC9pZHQ</a></p>\n<p>Kendrick saying “brother” at the end of every line in the middle part of his verse never fails to crack me up</p>\n"
	,
			"tags": [
					"kendrick lamar"
					,
					"baby keem"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1737830932336/",
			"url": "https://secretchoir.com/post/1737830932336/",
			"title": "2024 Safe Bets: Cliffdiver - _Birdwatching_",
			"content_html": "<p><a href=\"https://cliffdiverok.bandcamp.com/album/birdwatching\">https://cliffdiverok.bandcamp.com/album/birdwatching</a></p>\n<p>Cliffdiver's second full-length album really delivered for me. It's not surprising in hindsight that their debut album <a href=\"https://cliffdiverok.bandcamp.com/album/exercise-your-demons\">Exercise Your Demons</a> wouldn't live up to the high expectations set by their 2020 song <a href=\"https://cliffdiverok.bandcamp.com/track/gas-city\">Gas City</a>; it's by all means a good album but for me it lacked the sort of top-tier memorability that I'm looking for when listening to this sort of on-the-nose pop-punk \"DIY\" music. Birdwatching, as a counterpoint, sold me from the very start with opener \"thirty, flirty, and thriving!!!\" Co-lead vocalists Joey Duffy and Briana Wright are both extremely charming, the band's work continues to be my favorite use of the saxophone in recent memory, the whole album kinda breezes by and dares you to go back to the start and listen all over again like many of my favorite albums this year, and I would like one hundred more years of Cliffdiver songs to put me in a good mood and make me feel thirty years old again.</p>\n"
	,
			"tags": [
					"2024"
					,
					"safe bets"
					,
					"cliffdiver"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1737793501006/",
			"url": "https://secretchoir.com/post/1737793501006/",
			"title": "Untitled Post",
			"content_html": "<p>bards will be like \"so baby listen carefully / while I sing my combat song\"</p>\n"
	,
			"tags": [
					"mark morrison"
					,
					"weird ones"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1737690228269/",
			"url": "https://secretchoir.com/post/1737690228269/",
			"title": "2024 Safe Bets: Armlock - _Seashell Angel Lucky Charm_ ",
			"content_html": "<p><a href=\"https://armlock.bandcamp.com/album/seashell-angel-lucky-charm\">https://armlock.bandcamp.com/album/seashell-angel-lucky-charm</a></p>\n<p>This second album by the Australian slacker-rock duo is a perfect example of why I love <a href=\"https://runforcoverrecords.com/\">Run For Cover Records</a>. It's unfortunately brief, weighing in at just 19 minutes across 7 tracks, but I had it in the rotation pretty regularly in 2024. The lofi music videos put out over the course of the year match the vibe pretty well. More of this please!</p>\n"
	,
			"tags": [
					"2024"
					,
					"safe bets"
					,
					"armlock"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1737187355122/",
			"url": "https://secretchoir.com/post/1737187355122/",
			"title": "2025 wishes",
			"content_html": "<p>new Lorde album (but good this time)</p>\n"
	,
			"tags": [
					"lorde"
					,
					"good ideas"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1737186514048/",
			"url": "https://secretchoir.com/post/1737186514048/",
			"title": "listening to &quot;Classical&quot; again and",
			"content_html": "<p><a href=\"https://www.youtube.com/watch?v=nP2FbpYs4t0\">https://www.youtube.com/watch?v=nP2FbpYs4t0</a></p>\n<p>there's a sort of weird slowed-breakbeat-ness to the drums on this track, right?</p>\n"
	,
			"tags": [
					"vampire weekend"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1737096845064/",
			"url": "https://secretchoir.com/post/1737096845064/",
			"title": "Untitled Post",
			"content_html": "<p>just thinking about how if we got new music from both sadurn and cartalk this year that'd pretty much be all I need</p>\n"
	,
			"tags": [
					"sadurn"
					,
					"cartalk"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1736927939285/",
			"url": "https://secretchoir.com/post/1736927939285/",
			"title": "2024 You Could Make a Case For: Durante - _Enter_",
			"content_html": "<p><a href=\"https://durante.bandcamp.com/album/enter\">https://durante.bandcamp.com/album/enter</a></p>\n<p>the \"You Could Make a Case For\" series is for albums that did not spring to mind for me immediately, but when reviewing the stuff I did actually listen to this year, I noticed them as things that I definitely did find myself pressing play on during the course of the year.</p>\n<p>I first learned about Durante via the 2019 Fabric DJ mix by electronic artist Bonobo, an album I listened to constantly both by myself and when putting on music for other people. His track \"Maia\" swoops in beautifully and while he didn't have many tracks released at that point, I was excited eventually to discover his 2021 song \"Thread Tension\", a driving, hypnotic track. There were some releases here and there but it was this year's <em>Enter</em> and the accompanying <a href=\"https://www.youtube.com/watch?v=nWdIkR-6Vio\">February</a> and <a href=\"https://www.youtube.com/watch?v=Vh246_Mgk7o\">May</a> DJ mixes that I could tell there was something special he was doing, creating a sound I'm really glad to have had available to me this year.</p>\n"
	,
			"tags": [
					"2024"
					,
					"you could make a case for"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1736924679776/",
			"url": "https://secretchoir.com/post/1736924679776/",
			"title": "2024 Safe Bets: Vegyn - _The Road to Hell is Paved with Good Intentions_",
			"content_html": "<p><a href=\"https://vegyn.bandcamp.com/album/the-road-to-hell-is-paved-with-good-intentions\">https://vegyn.bandcamp.com/album/the-road-to-hell-is-paved-with-good-intentions</a></p>\n<p>I dunno what to say about this one, it just is the mood I felt in the most this year. I felt ready to put this on just about any time-- as a plane was landing, when I couldn't sleep, when I had a quiet afternoon sitting around peacefully with my parents in my new living room, when I was walking around a new part of San Francisco I had never been in before (near the Moscone Center? lol), just any time really. I guess that makes it the next in a series:</p>\n<p>2024 - this one<br>\n2023 - overmono - good lies<br>\n2022 - sadurn - radiator<br>\n2021 - ross from friends - tread<br>\n2020 - cartalk - pass like pollen<br>\n2019 - glass beach - the first glass beach album</p>\n"
	,
			"tags": [
					"2024"
					,
					"safe bets"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1736923909329/",
			"url": "https://secretchoir.com/post/1736923909329/",
			"title": "2024 Safe Bets: Vampire Weekend - _Only God Was Above Us_",
			"content_html": "<p><a href=\"https://us.7digital.com/artist/vampire-weekend/release/only-god-was-above-us-explicit-39422357\">https://us.7digital.com/artist/vampire-weekend/release/only-god-was-above-us-explicit-39422357</a></p>\n<p>I had very complicated feelings about <em>Father of the Bride</em>, though ultimately came out pretty positive about it. I do feel like this is a return to <em>Modern Vampires</em> success but also I feel a little bit guilty about feeling that way because of the <em>signifiers</em></p>\n"
	,
			"tags": [
					"safe bets"
					,
					"2024"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		,
		{
			"id": "https://secretchoir.com/post/1736923709481/",
			"url": "https://secretchoir.com/post/1736923709481/",
			"title": "2024 Safe Bets: Saeph - _Verdant_",
			"content_html": "<p><a href=\"https://saeph.bandcamp.com/album/verdant\">https://saeph.bandcamp.com/album/verdant</a></p>\n<p>Listening to this album does make me feel alive-- alive because I can hear the influences from Porter Robinson and Madeon, from chiptunes to blasted out VHS copies of anime series you've never remembered the title of recovered from a friends of the library table sale. Listen to this album if you're a little goblin in the forest in an RPG Maker game</p>\n"
	,
			"tags": [
					"2024"
					,
					"safe bets"
					
			],
			"date_published": "2025-03-04T23:27:52Z"
		}
		
]
}
